{
    "status": "ok",
    "totalResults": 1286,
    "articles": [{
        "source": {
            "id": "the-wall-street-journal",
            "name": "The Wall Street Journal"
        },
        "author": "Emily Glazer",
        "title": "Joe Biden Tells Supporters He Plans 2020 Bid - The Wall Street Journal",
        "description": "Joe Biden Tells Supporters He Plans 2020 Bid The Wall Street Journal Biden leads CNN poll, but Harris, Sanders on the rise | TheHill The Hill Joe Biden’s Potential Bid for President Would Come with Baggage National Review How ‘Middle Class Joe’ can make a spl…",
        "url": "https://www.wsj.com/articles/joe-biden-tells-supporters-he-plans-2020-bid-11553033380",
        "urlToImage": "https://images.wsj.net/im-61037/social",
        "publishedAt": "2019-03-19T23:20:46Z",
        "content": "Former Vice President Joe Biden reached out to at least a half-dozen supporters Tuesday to tell them he intends to run for president and to ask for their help in lining up contributions from major donors so he can quickly raise several million dollars, a pers… [+269 chars]"
    },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": "Sam Schechner , Valentina Pop",
            "title": "The Wall Street Journal: Google offers up Android concessions in bid to appease EU antitrust regulators",
            "description": "Google plans to ask all Android smartphone users in Europe whether they want to switch to competing search engines or web browsers, one of two new concessions the search giant is offering to stave off complaints — and potential fines — from European Union ant…",
            "url": "https://www.wsj.com/articles/google-offers-concessions-on-eve-of-new-eu-antitrust-rebuke-11553036341",
            "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-GM259_google_ZG_20180710170110.jpg",
            "publishedAt": "2019-03-19T22:25:59Z",
            "content": "Google plans to ask all Android smartphone users in Europe whether they want to switch to competing search engines or web browsers, one of two new concessions the search giant is offering to stave off complaints and potential fines from European Union antitru… [+1394 chars]"
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": null,
            "title": "President Trump: U.S. Could Be 'A Lot Tougher' on Venezuela Sanctions",
            "description": "At a joint press conference with Brazil's President Jair Bolsonaro, President Trump discussed sanctions against Venezuela and the possibility of military intervention. Photo: Getty",
            "url": "https://www.wsj.com/video/president-trump-us-could-be-a-lot-tougher-on-venezuela-sanctions/DE2542BF-2901-4B19-9023-CDD01D4ECB85.html",
            "urlToImage": "http://m.wsj.net/video/20190319/031919trumpbrazil/031919trumpbrazil_1280x720.jpg",
            "publishedAt": "2019-03-19T21:47:45Z",
            "content": null
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": "Andy Pasztor",
            "title": "White House to Nominate Steve Dickson as Permanent FAA Head - The Wall Street Journal",
            "description": "White House to Nominate Steve Dickson as Permanent FAA Head The Wall Street Journal President Trump picks ex-Delta executive Steve Dickson to lead FAA amid Boeing 737 Max crisis CNBC Trump taps former Delta pilot to lead FAA amid turmoil POLITICO Trump nomina…",
            "url": "https://www.wsj.com/articles/steve-dickson-is-white-house-pick-as-permanent-faa-head-11553024733",
            "urlToImage": "https://images.wsj.net/im-60965/social",
            "publishedAt": "2019-03-19T21:21:29Z",
            "content": "With the Federal Aviation Administration facing mounting scrutiny domestically and overseas, the White House said it plans to nominate Steve Dickson, a former senior Delta Air Lines official, as permanent head of the agency, according to people familiar with … [+244 chars]"
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": "Sara Randazzo",
            "title": "Jury Finds Bayer’s Roundup Weedkiller Caused Man’s Cancer",
            "description": "A jury found that a man developed cancer from exposure to Roundup weedkiller he used in his yard, in the second case to go to trial over the alleged harms of the popular Bayer product.",
            "url": "https://www.wsj.com/articles/jury-finds-bayers-roundup-weedkiller-caused-mans-cancer-11553030151",
            "urlToImage": "https://images.wsj.net/im-56037/social",
            "publishedAt": "2019-03-19T21:20:27Z",
            "content": "SAN FRANCISCOA jury found that a man developed cancer from exposure to Roundup weedkiller he used in his yard, in the second case to go to trial over the alleged harms of the popular Bayer AG product.\r\nThe six-person jury in U.S. District Court in San Francis… [+194 chars]"
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": "Bob Davis",
            "title": "High-Level U.S.-China Trade Talks to Resume in Final Push for Deal - The Wall Street Journal",
            "description": "High-Level U.S.-China Trade Talks to Resume in Final Push for Deal The Wall Street Journal Trade talks are in final stages, but there is still fear China may walk back concessions: Reports CNBC U.S. Sees China Trade Pushback as Trump Touts Progress Bloomberg …",
            "url": "https://www.wsj.com/articles/lighthizer-mnuchin-to-travel-to-beijing-11553015413",
            "urlToImage": "https://images.wsj.net/im-60923/social",
            "publishedAt": "2019-03-19T20:42:44Z",
            "content": "WASHINGTONNegotiators for the U.S. and China have scheduled a new round of high-level trade talks in Beijing and Washington, aiming to close a deal by late April to end the yearlong dispute between the worlds two largest economies.\r\nU.S. Trade Representative … [+270 chars]"
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": "Michelle Slatalla",
            "title": "Why I'm Swapping My iPhone For An Alarm Clock From 1939",
            "description": "Columnist Michelle Slatalla makes a case for turning back the hands of time and embracing an object designed to perform a single task flawlessly.",
            "url": "https://www.wsj.com/articles/why-im-swapping-my-iphone-for-an-alarm-clock-from-1939-11553009785",
            "urlToImage": "https://si.wsj.net/public/resources/images/OG-CL156_201903_SOC_20190318120508.gif",
            "publishedAt": "2019-03-19T19:04:37Z",
            "content": "SOME PEOPLE LOOK at an iPhone and see a stylish, sleek slice of the future. I see a greasy, fingerprinted screen lying on my night stand.\r\nWhat I would like to see is a bedside lamp casting a warm glow on something entirely different: a well-designed object w… [+88 chars]"
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": "Sarah Krouse",
            "title": "Ex-AOL Boss Gets $60 Million Exiting VERIZON...",
            "description": "Tim Armstrong, Former AOL Boss, Getting More Than $60 Million as He Exits Verizon Tim Armstrong, the former leader of AOL, is walking away with more than $60 million as he leaves Verizon Communications Inc., which recently wrote down half the value of the int…",
            "url": "https://www.wsj.com/articles/tim-armstrong-former-aol-boss-getting-more-than-60-million-as-he-exits-verizon-11553014033",
            "urlToImage": "https://images.wsj.net/im-60823/social",
            "publishedAt": "2019-03-19T19:00:57Z",
            "content": "Tim Armstrong, the former leader of AOL, is walking away with more than $60 million as he leaves Verizon Communications Inc., which recently wrote down half the value of the internet business he led. \r\nThe cash and stock awards and other benefits, pieced toge… [+221 chars]"
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": null,
            "title": "Interest Rates, the Fed and Inflation: WSJ Glossary",
            "description": "Inflation is among the most powerful forces in financial markets, but too much or too little can send the economy spiraling. Here's how it works, and how the Fed works to regulate it. Photo composite: Dom Amatore for The Wall Street Journal",
            "url": "https://www.wsj.com/video/interest-rates-the-fed-and-inflation-wsj-glossary/896503FD-DD78-45E1-BE52-35DC6CCC4D9C.html",
            "urlToImage": "http://m.wsj.net/video/20190319/031919glossaryinflation3/031919glossaryinflation3_1280x720.jpg",
            "publishedAt": "2019-03-19T18:16:35Z",
            "content": null
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": "Jim Carlton",
            "title": "The $1M HOA Blowup: Started With Misplaced Flower Pots...",
            "description": "The $1M HOA Blowup: Started With Misplaced Flower Pots... (Third column, 3rd story, link ) Related stories: Lawyers who took on Big Tobacco now going after realtors and 6% commission... Advertise here",
            "url": "https://www.wsj.com/articles/the-1-million-hoa-blowup-it-started-with-the-misplaced-flower-pots-11553006590",
            "urlToImage": "https://si.wsj.net/public/resources/images/B3-DL711_HOA_1J_SOC_20190318140400.jpg",
            "publishedAt": "2019-03-19T18:10:38Z",
            "content": "OLATHE, Kan.Soon after Jim Hildenbrand arrived in Avignon Villa Homes, a community for older adults in a Kansas City suburb, the homeowner association disputed the placement of his satellite dish. It cited him for parking cars in his driveway overnight and pl… [+204 chars]"
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": "Andrew Beaton",
            "title": "HAPPY ENDING: Prosecutors Offer to Drop Charges Against PATRIOTS Owner Bob Kraft...",
            "description": "Florida prosecutors have offered to drop charges against New England Patriots owner Robert Kraft and a number of other men charged with soliciting prostitution.",
            "url": "https://www.wsj.com/articles/florida-prosecutors-offer-to-drop-charges-against-patriots-owner-robert-kraft-11553014972",
            "urlToImage": "https://images.wsj.net/im-60918/social",
            "publishedAt": "2019-03-19T17:40:37Z",
            "content": "Florida prosecutors have offered to drop charges against New England Patriots owner Robert Kraft and a number of other men charged with soliciting prostitution, according to a person familiar with the matter, but there is a catch. The proposed agreement calls… [+271 chars]"
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": "Elizabeth Bernstein",
            "title": "The Art of Being Single",
            "description": "Single people still face a stigma, even though their ranks have grown. Yet a new study suggests singles become happier as they age. One strategy: Focus on creating a full life now, for yourself, rather than finding a partner.",
            "url": "https://www.wsj.com/articles/the-art-of-being-single-11553005457",
            "urlToImage": "https://si.wsj.net/public/resources/images/B3-DL745_Bonds0_SOC_20190318165029.jpg",
            "publishedAt": "2019-03-19T17:27:28Z",
            "content": "After Katie Tomaszewski divorced at the age of 28, she felt ashamed to be alone. So she did what she thought a single person should do: She over-dated, over-worked and over-socialized, inviting friends over for dinner nearly every night because she was afraid… [+235 chars]"
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": null,
            "title": "Cyclone Idai Rips Through Southern Africa, Raising Fears of Humanitarian Crisis",
            "description": "The tropical storm that crashed into Mozambique, Zimbabwe and Malawi last week, left many dead and a trail of devastation, highlighting the region's exposure to climate change. Photo: Red Cross via Reuters",
            "url": "https://www.wsj.com/video/cyclone-idai-rips-through-southern-africa-raising-fears-of-humanitarian-crisis/5BFCF486-7042-481F-A80A-1BA28DAB6E73.html",
            "urlToImage": "http://m.wsj.net/video/20190319/031919mozambique/031919mozambique_1280x720.jpg",
            "publishedAt": "2019-03-19T17:09:02Z",
            "content": null
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": "arcanus",
            "title": "California Has the Jobs but Not Enough Homes",
            "description": "Article URL: https://www.wsj.com/articles/california-has-the-jobs-but-not-enough-homes-11553007600 Comments URL: https://news.ycombinator.com/item?id=19432788 Points: 9 # Comments: 4",
            "url": "https://www.wsj.com/articles/california-has-the-jobs-but-not-enough-homes-11553007600",
            "urlToImage": "https://si.wsj.net/public/resources/images/OG-CL294_CALBIZ_SOC_20190319122716.png",
            "publishedAt": "2019-03-19T17:01:30Z",
            "content": "SAN FRANCISCOCalifornias economy is adding jobs far faster than affordable places to live, forcing some employers to leave the state as they expand.\r\nCompanies that move from California have historically left behind its diverse industries, renowned public uni… [+230 chars]"
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": "Francis X. Rocca",
            "title": "Pope Francis Declines to Accept French Cardinal's Resignation - Wall Street Journal",
            "description": "Pope Francis Declines to Accept French Cardinal's Resignation Wall Street Journal Pope Rejects Resignation of French Cardinal Convicted of Abuse Cover-Up The New York Times Pope nixes French cardinal resignation after cover-up Fox News Pope rejects resignatio…",
            "url": "https://www.wsj.com/articles/pope-francis-declines-to-accept-french-cardinals-resignation-11553007071",
            "urlToImage": "https://images.wsj.net/im-60843/social",
            "publishedAt": "2019-03-19T15:51:00Z",
            "content": "ROMEPope Francis declined to accept the resignation of a French cardinal convicted of covering up sexual abuse, the Vatican said on Tuesday, a decision that drew fire from victims and their advocates in France and abroad.\r\nCardinal Philippe Barbarin of Lyon h… [+88 chars]"
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": "Laura Forman",
            "title": "Facebook Live Has Got to Go - Wall Street Journal",
            "description": "Facebook Live Has Got to Go Wall Street Journal New Zealand wants answers from Mark Zuckerberg over mosque attack video CNN No one reported New Zealand mosque shooting livestream as it happened, Facebook says USA TODAY We’re Asking the Wrong Questions of YouT…",
            "url": "https://www.wsj.com/articles/facebook-live-has-got-to-go-11553007109",
            "urlToImage": "https://images.wsj.net/im-60879/social",
            "publishedAt": "2019-03-19T15:51:00Z",
            "content": "Facebooks live-video feature is becoming a viral problem with no apparent antidote.\r\nChief Executive Officer Mark Zuckerberg said he wants to take Facebooks conversations out of the very public town square. But last week the company unwittingly gave users a f… [+270 chars]"
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": "Allison Prang",
            "title": "New Fox Begins Trading, Names New Directors Including Paul Ryan",
            "description": "Fox Corp., which began trading as a standalone company Tuesday after a spinoff from 21st Century Fox, named directors including Paul Ryan, former speaker of the U.S. House of Representatives, to its board.",
            "url": "https://www.wsj.com/articles/new-fox-begins-trading-names-new-directors-including-paul-ryan-11553005176",
            "urlToImage": "https://images.wsj.net/im-60845/social",
            "publishedAt": "2019-03-19T14:24:42Z",
            "content": "Fox Corp. started trading as a standalone company Tuesday following a spinoff from 21st Century Fox and named a number of directors, including Paul Ryan, former speaker of the U.S. House of Representatives, to its board.\r\nThe new Fox, which holds Foxs TV asse… [+169 chars]"
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": "Konrad Putzier",
            "title": "New Hotels Mushroom in Miami...",
            "description": "Hotel construction is booming in Miami thanks partly to the growing appeal of the city’s downtown district and the flocking of well-heeled tourists to South Beach.",
            "url": "https://www.wsj.com/articles/new-hotels-mushroom-in-miami-11552993200",
            "urlToImage": "https://images.wsj.net/im-60387/social",
            "publishedAt": "2019-03-19T11:19:39Z",
            "content": "Hotel construction is booming in Miami thanks partly to the growing appeal of the citys downtown district and the flocking of well-heeled tourists to South Beach.\r\nBut while room revenues have been rising overall and most observers believe the trend will cont… [+102 chars]"
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": "WSJ Staff",
            "title": "WSJ Wealth Adviser Briefing: Active Investing, Solar Stocks, Parent’s Money",
            "description": "Lower fees and rising volatility are making active management more competitive; solar demand is on the upswing and solar stocks are responding, and parents are warned against sharing their salaries with their children.",
            "url": "https://blogs.wsj.com/moneybeat/2019/03/19/wsj-wealth-adviser-briefing-active-investing-solar-stocks-parents-money/",
            "urlToImage": "https://s.wsj.net/blogs/img/WSJ_Logo_BlackBackground_1200x630social",
            "publishedAt": "2019-03-19T10:00:42Z",
            "content": "Mar 19, 2019 6:00 am ET\r\n With its eye on wealthier international clients, Morgan Stanley is merging its international wealth management and private wealth management businesses. Below, some of the best analysis and insight from WSJ writers and columnists, th… [+148 chars]"
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": "Jennifer Maloney",
            "title": "The Wall Street Journal: Budweiser parent and Keurig Dr Pepper to sell single-serve cocktail maker through Drinkworks joint venture",
            "description": "Keurig Dr Pepper Inc. and Anheuser-Busch InBev SA are pushing ahead with an idea to automate home bartending with a K-Cup machine for cocktails, seeking to tap new areas of growth as sales of their core products slow.",
            "url": "https://www.wsj.com/articles/white-russian-in-a-pod-budweiser-maker-pushes-k-cup-machine-for-cocktails/",
            "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-HF923_drinkw_ZG_20190319063637.jpg",
            "publishedAt": "2019-03-19T09:48:26Z",
            "content": "Keurig Dr Pepper Inc. and Anheuser-Busch InBev SA\r\nBUD, +1.01%ABI, +2.96%\r\n are pushing ahead with an idea to automate home bartending with a K-Cup machine for cocktails, seeking to tap new areas of growth as sales of their core products slow.\r\nAfter a recent… [+1981 chars]"
        }
    ]
}